#include "custom_paint.h"
#include "skinchanger.h"
#include "skin_preview.h"

#include "../../config/config.h"
#include "../../utils/console/console.h"
#include "../../utils/memory/memsafe/memsafe.h"
#include "../../utils/memory/patternscan/patternscan.h"
#include "../../utils/security/vacdetect.h"
#include "../../../../external/safetyhook/safetyhook.hpp"

#include <Windows.h>
#include <cstddef>
#include <cstdint>
#include <cstring>
#include <cstdio>
#include <algorithm>

namespace CustomPaint {
namespace {

// Schema: CompositeMaterialInputLooseVariable_t size 0x288
// m_strName @ 0x0 (CUtlString), m_nVariableType @ 0x40, m_cValueColor4 @ 0x8C
// LOOSE_VARIABLE_TYPE_COLOR4 = 9
// CPaintKit: id@0, name@8, style@0x48, color0..3@0x4C (IDA sub_18109D630)

enum : int32_t {
	kLooseVarFloat3 = 7,
	kLooseVarColor4 = 9,
};
constexpr std::uintptr_t kOffPaintKits = 0x2F0;
constexpr std::uintptr_t kOffKitStyle  = 0x48;
constexpr std::uintptr_t kOffKitColors = 0x4C;

#pragma pack(push, 1)
struct CompositeMaterialInputLooseVariable_t {
	char*    m_strName;              // 0x00 CUtlString
	uint8_t  pad_008[0x38];
	int32_t  m_nVariableType;        // 0x40
	uint8_t  pad_044[0x18];
	float    m_flValueFloatX;        // 0x5C  (also used by FLOAT4 mats)
	float    m_flValueFloatX_Min;    // 0x60
	float    m_flValueFloatX_Max;    // 0x64
	float    m_flValueFloatY;        // 0x68
	float    m_flValueFloatY_Min;    // 0x6C
	float    m_flValueFloatY_Max;    // 0x70
	float    m_flValueFloatZ;        // 0x74
	float    m_flValueFloatZ_Min;    // 0x78
	float    m_flValueFloatZ_Max;    // 0x7C
	float    m_flValueFloatW;        // 0x80
	float    m_flValueFloatW_Min;    // 0x84
	float    m_flValueFloatW_Max;    // 0x88
	uint32_t m_cValueColor4;         // 0x8C
	uint8_t  pad_090[0x288 - 0x90];
};
#pragma pack(pop)
static_assert(sizeof(CompositeMaterialInputLooseVariable_t) == 0x288, "loose var size");
static_assert(offsetof(CompositeMaterialInputLooseVariable_t, m_nVariableType) == 0x40, "type off");
static_assert(offsetof(CompositeMaterialInputLooseVariable_t, m_flValueFloatX) == 0x5C, "floatx off");
static_assert(offsetof(CompositeMaterialInputLooseVariable_t, m_cValueColor4) == 0x8C, "color off");

struct PaintKitNode {
	int left, right, pad8, pad12, key, pad20;
	void* value;
};
static_assert(sizeof(PaintKitNode) == 32, "node");

struct PaintKitMap {
	int count;
	int capacity_flags;
	PaintKitNode* elements;
};

using AppendFn = void(__fastcall*)(void* vector, const CompositeMaterialInputLooseVariable_t* var);
using AllocFn  = void*(__fastcall*)(size_t);

static AppendFn              g_append = nullptr;
static AllocFn               g_alloc  = nullptr;
static safetyhook::MidHook   g_midWeapon{};
